Revit 2027 API
FabricationPart.ProductLongDescription Property
 The product long description of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProductLongDescription { get; }
Public ReadOnly Property ProductLongDescription As String
	Get
public:
property String^ ProductLongDescription {
	String^ get ();
}
member ProductLongDescription : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace